/*
Дано два целых числа одинаковой длины. 
Учитывая, что метод Console.ReadLine( ) всегда возвращает строку,
а строка - это массив символов, напишите программу, которая должна пройти по всем элементам этих чисел и 
сравнить их. Первый элемент первого числа сравнивается с первым элементом второго, и т.д. В консоль должен
быть выведен ответ :
"Совпадение n элементов", где n - количество совпавших элементов.

Пример:
13456 
23550

У этих чисел одинаковые 2ой и 4ый элемент, следовательно ответ:

"Совпадение 2 элементов"

Sample Input:

13456
23550
Sample Output:

Совпадение 2 элементов
*/
Console.Clear();
Console.Write("Введи  число больше 4 символов: ");

