// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
// Console.WriteLine("Hello, World!");

internal class Program
{
    private static void Main(string[] args)
    {
        int a = GetNumbers("ВВедите число");
    }
}